app/views/questions/new.html.erb

SELECT "topics".* FROM "topics"
---
	<%=f.label 'Select Topic' %>
	<%=f.select :topic_id, options_for_select(Topic.all.map{|t|[t.name,t.id]}) %>