app/controllers/answers_controller.rb

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "answers" ("name", "user_id", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "answer_1"], ["user_id", 3], ["question_id", 1], ["created_at", "2020-09-15 17:54:01.211039"], ["updated_at", "2020-09-15 17:54:01.211039"]]
---
  def create
    question = Question.find(params[:question_id])
    answer = question.answers.new(answers_params.merge(user_id: current_user.id))
    if answer.save