app/controllers/follower_controller.rb

INSERT INTO "user_followers" ("user_id", "follower_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["follower_id", 3], ["created_at", "2020-09-15 18:19:06.270884"], ["updated_at", "2020-09-15 18:19:06.270884"]]
---
	def follow_user
		unless validate_following_user?
			follower = @user.user_followers.create(follower_id: current_user.id)

INSERT INTO "topic_followers" ("user_id", "topic_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["topic_id", 1], ["created_at", "2020-09-15 18:16:19.238178"], ["updated_at", "2020-09-15 18:16:19.238178"]]
SELECT 1 AS one FROM "topic_followers" WHERE "topic_followers"."topic_id" = ? AND "topic_followers"."user_id" = ? LIMIT ?  [["topic_id", 1], ["user_id", 3], ["LIMIT", 1]]
---
	def follow_topic
		follower = current_user.topic_followers.create(topic_id: @topic_id)
		redirect_to '/', notice: follower.errors.present? ? follower.errors.full_messages.join(', ') : 'Topic followed sucessfully'

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
	def find_user
		@user = Question.find(params[:id]).user

SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def find_topic_id
		@topic_id = Question.find(params[:id]).topic_id