app/controllers/questions_controller.rb

	def create
		question = current_user.questions.new(question_params)
		if question.save
---
INSERT INTO "questions" ("name", "topic_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "question_2"], ["topic_id", 2], ["user_id", 3], ["created_at", "2020-09-15 18:22:53.995221"], ["updated_at", "2020-09-15 18:22:53.995221"]]