app/controllers/topics_controller.rb

INSERT INTO "topics" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "topic1"], ["created_at", "2020-09-15 17:45:06.787932"], ["updated_at", "2020-09-15 17:45:06.787932"]]
---
	def create
		topic = Topic.new(topic_params)
		if topic.save